; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v1 - type_1 ?v3 - type_3)
 	      (pred_3 ?v8 - object ?v3 - type_3)
	      (pred_4 ?v1 - type_1 ?v5 - type_2)
	      (pred_1 ?v1 - type_1 ?v8 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v6 - type_3)
       :precondition (and  (pred_2 ?v1 ?v2))
       :effect (and  (pred_2 ?v1 ?v6)
		     (not (pred_2 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_1 ?v4 - object ?v7 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v7) (pred_2 ?v1 ?v7) (pred_4 ?v1 ?v5))
       :effect (and (pred_1 ?v1 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v7)) 
		    (not (pred_4 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_1 ?v4 - object ?v7 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v4 ?v5) (pred_2 ?v1 ?v7))
       :effect (and (pred_3 ?v4 ?v7)
		    (pred_4 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_09 - type_1
obj_02 obj_10 obj_13 obj_12 - type_2
obj_03 obj_07 obj_01 obj_14 - type_3
obj_08 obj_11 obj_06 obj_05 - object)
(:init
(pred_2 obj_04 obj_14)
(pred_4 obj_04 obj_02)
(pred_4 obj_04 obj_10)
(pred_2 obj_09 obj_01)
(pred_4 obj_09 obj_13)
(pred_4 obj_09 obj_12)
(pred_3 obj_08 obj_03)
(pred_3 obj_11 obj_01)
(pred_3 obj_06 obj_07)
(pred_3 obj_05 obj_03)
)
(:goal
(and
(pred_3 obj_08 obj_01)
(pred_3 obj_11 obj_14)
(pred_3 obj_06 obj_07)
(pred_3 obj_05 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_04 obj_01) (pred_2 obj_09 obj_01))))
  )
)
)

; plan
1. (op_1 obj_09 obj_11 obj_01 obj_12)
   deleted: (pred_3 obj_11 obj_01) (pred_4 obj_09 obj_12)
   added: (pred_1 obj_09 obj_11 obj_12)
   goals met: 1 of 4
2. (op_3 obj_09 obj_01 obj_14)
   deleted: (pred_2 obj_09 obj_01)
   added: (pred_2 obj_09 obj_14)
   goals met: 1 of 4
3. (op_3 obj_04 obj_14 obj_01)
   deleted: (pred_2 obj_04 obj_14)
   added: (pred_2 obj_04 obj_01)
   goals met: 1 of 4
4. (op_2 obj_09 obj_11 obj_14 obj_12)
   deleted: (pred_1 obj_09 obj_11 obj_12)
   added: (pred_3 obj_11 obj_14) (pred_4 obj_09 obj_12)
   goals met: 2 of 4
5. (op_3 obj_04 obj_01 obj_03)
   deleted: (pred_2 obj_04 obj_01)
   added: (pred_2 obj_04 obj_03)
   goals met: 2 of 4
6. (op_1 obj_04 obj_05 obj_03 obj_10)
   deleted: (pred_3 obj_05 obj_03) (pred_4 obj_04 obj_10)
   added: (pred_1 obj_04 obj_05 obj_10)
   goals met: 2 of 4
7. (op_1 obj_04 obj_08 obj_03 obj_02)
   deleted: (pred_3 obj_08 obj_03) (pred_4 obj_04 obj_02)
   added: (pred_1 obj_04 obj_08 obj_02)
   goals met: 2 of 4
8. (op_3 obj_04 obj_03 obj_01)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_01)
   goals met: 2 of 4
9. (op_2 obj_04 obj_08 obj_01 obj_02)
   deleted: (pred_1 obj_04 obj_08 obj_02)
   added: (pred_3 obj_08 obj_01) (pred_4 obj_04 obj_02)
   goals met: 3 of 4
10. (op_3 obj_04 obj_01 obj_07)
   deleted: (pred_2 obj_04 obj_01)
   added: (pred_2 obj_04 obj_07)
   goals met: 3 of 4
11. (op_2 obj_04 obj_05 obj_07 obj_10)
   deleted: (pred_1 obj_04 obj_05 obj_10)
   added: (pred_3 obj_05 obj_07) (pred_4 obj_04 obj_10)
   goals met: 4 of 4
